# Pandas
* Unlike Numpy in pandas data visuallise with proper methods like in Tabuler form, in GUI etc
    - buietiful way of representation
    - informative way


    - 2 types of datastructure:
      1. Series : structured/tabuler data which is always 1D
      2. Dataframe:structured/tabuler data which is always 2D

## Pandas
 - Series   : 
      - is a 1D  Array 
      - is a homogeneuous array,
      - its size immutable but elements are mutable
      
 - DataFrame: 
      - is a 2D  Array
      - size mutable tabuler structure with potentially heterogeneously typed columns.   
      
 - Panel    : 
      - 3D arrays
      - size mutable array
      - however it is rarely used in image.
 
 
    * these three objects are supported by pandas data package

 * Adventages over numpy: 
   - fast and efficient dataframe object with default and customized indexing.
   - their are tools for loading data from different file formats to a local current system.
   - reshaping and pivoting of data sets(for handlling large data sets
   - provides label based slicing,indexing and subsetting of large datasets
   - columns from data sets can be deleted or inserted
   - hign performance merging and joining of data
   - time series functionality provided to handle time series data

### 1) Series
   - 1D ie basically its a column (having homogeneuos data mostaly)
   - We can create a series using 1.list, 2.tuple, 3.dictionary

In [3]:
# import package
# !pip install pandas      # one time process to install pandas in system/jupyter notebook
import pandas as pd        #every time you need to import pandas once before use

In [4]:
# creating simple series
s = pd.Series(data =range(1,11))
print(type(s))
s

<class 'pandas.core.series.Series'>

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [14]:
s = pd.Series(data = [1,2,1.2])  #type casted to float
print(type(s))
s

<class 'pandas.core.series.Series'>

0    1.0
1    2.0
2    1.2
dtype: float64

In [5]:
# in series highest data type is string but it is known as object for series case only
s = pd.Series(data = [1,2,1.2,'string']) #typecasted to series == object type
print(type(s))
s

<class 'pandas.core.series.Series'>

0         1
1         2
2       1.2
3    string
dtype: object

In [6]:
#passing manual index
s = pd.Series(data = [1,2,1.2,'string'], index = ['a','b','c','d'])
print(type(s))
s

<class 'pandas.core.series.Series'>

a         1
b         2
c       1.2
d    string
dtype: object

In [7]:
# 1. using list

# observe th diffrence between numpy and  pandas
import numpy as np
river = ['ganga', ' yamuna' , 'neil' , 'brazos' , 'tennessee']   # type: U9
np.array(river)

array(['ganga', ' yamuna', 'neil', 'brazos', 'tennessee'], dtype='<U9')

In [7]:
data=pd.Series(river)
print(type(data))          # pandas core series
data

<class 'pandas.core.series.Series'>

0        ganga
1       yamuna
2         neil
3       brazos
4    tennessee
dtype: object

In [8]:
# we can change default index values too

data = pd.Series(river , index = ['a' , 'b' , 'c' , 'd' , 'e'])
data

a        ganga
b       yamuna
c         neil
d       brazos
e    tennessee
dtype: object

In [17]:
### using nested list >> ie we could create multiple colume using list in series as well
s = pd.Series(data = [[1,2],[3,4],[5,6]])
print(type(s))
s

<class 'pandas.core.series.Series'>

0    [1, 2]
1    [3, 4]
2    [5, 6]
dtype: object

In [10]:
# 2. create series using numpy array
data = pd.Series(np.random.rand(5))
data

0    0.503655
1    0.968657
2    0.738992
3    0.264604
4    0.423104
dtype: float64

In [16]:
import numpy as np
### using array
s = pd.Series(data = np.array(range(1,21)))
print(type(s))
s

<class 'pandas.core.series.Series'>

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
15    16
16    17
17    18
18    19
19    20
dtype: int32

In [72]:
# 2. Create data frame using dic
s = pd.Series(data = {'a':1,'b':2,'c':3})
print(type(s))
s

<class 'pandas.core.series.Series'>

a    1
b    2
c    3
dtype: int64

In [19]:

# - key is index and value the value
# - you cannot change the index of your choice
# - any new value in the index it will store it as a nan

data_dic = {'a':0 , 'b':1 , 'c':2 , 'd':3.0}
data = pd.Series(data_dic, index = ['a' , 'b' , 'c' , 'd','e'])
data

a    0.0
b    1.0
c    2.0
d    3.0
e    NaN
dtype: float64

## Accessing series elements

In [10]:
### using array
s = pd.Series(data = np.array(range(1,6)))
print(s)
print('\n')
print(s[0])   #here console gives you only value at index 0 ### access by index
print('\n')
print(s[1:4])  #here console gives you key and valued result

0    1
1    2
2    3
3    4
4    5
dtype: int32


1


1    2
2    3
3    4
dtype: int32

In [21]:
#  indexing

data = pd.Series(river , index = ['a' , 'b' , 'c' , 'd' , 'e'])
print (data)
print(data[2])  # with index

print(data['a'])

a        ganga
b       yamuna
c         neil
d       brazos
e    tennessee
dtype: object
neil
ganga

In [23]:
#slicing
print(data[1:])
print('\n\n')
print(data[1::2])

b       yamuna
c         neil
d       brazos
e    tennessee
dtype: object



b     yamuna
d     brazos
dtype: object

In [24]:
# user define index slicing

data['d':'a':-1] #  both start and stop are inclusive

d     brazos
c       neil
b     yamuna
a      ganga
dtype: object

In [11]:
### using array
s = pd.Series(data = np.array(range(1,6)),index = list('abcde'))
print(s)
print('\n')
print(s['a']) # access by label
print('\n')
print(s['b':'d'])

a    1
b    2
c    3
d    4
e    5
dtype: int32


1


b    2
c    3
d    4
dtype: int32

In [12]:
# duplicate indices
s = pd.Series(data = [1,2,1.2,'string'], index = ['a','b','a','d'])
print(s)
print('\n')
print(s['a']) #give result for both 'a'

a         1
b         2
a       1.2
d    string
dtype: object


a      1
a    1.2
dtype: object

In [24]:
#ex 2 create a Series where country is value and currency is the index
brics_country =  ['brazil' , 'russia' , 'india' , 'china' , 'South africa']
brics_curreny = ['real' , 'ruble' , 'rupee' , 'renminbi' , 'rand']

In [25]:
data=pd.Series(brics_country,index=brics_curreny) 
print(data)
print('\n')
print(data.shape)
print('\n')
print(data[3])
print('\n')# index value
print(data['rand']) 
print('\n')# user define index
print(data[3:100])

real              brazil
ruble             russia
rupee              india
renminbi           china
rand        South africa
dtype: object


(5,)


china


South africa


renminbi           china
rand        South africa
dtype: object

In [26]:
# index value
# user define index
data['real' : 'rupee']

real     brazil
ruble    russia
rupee     india
dtype: object

In [27]:
data.index

Index(['real', 'ruble', 'rupee', 'renminbi', 'rand'], dtype='object')

In [28]:
data.values

array(['brazil', 'russia', 'india', 'china', 'South africa'], dtype=object)

In [31]:
data[[1,2,3]]

ruble       russia
rupee        india
renminbi     china
dtype: object

In [35]:
data[['ruble']].values

array(['russia'], dtype=object)

### Dataframe
    -2D basically its a table having rows and columns (no of series == dataframe)
    -it has heterogeneuos data mostaly (columns can be of different types)
    -size:mutable
    -can perform arithmatic operations on rows and columns

In [36]:
import pandas as pd

In [37]:
# create an empty data

empty_df = pd.DataFrame()
print(empty_df)
print(type(empty_df))

Empty DataFrame
Columns: []
Index: []
<class 'pandas.core.frame.DataFrame'>

In [38]:
data = pd.DataFrame(brics_country)
data

              0
0        brazil
1        russia
2         india
3         china
4  South africa

In [39]:
data.shape

(5, 1)

In [40]:
# change the columns
data = pd.DataFrame(brics_country , columns = ['country'])
data

        country
0        brazil
1        russia
2         india
3         china
4  South africa

In [43]:
## 2. Create data frame using dic #dic -- key - columns and vlaue is the row data

df = pd.DataFrame({'a':[3,8] , 'b':[4,5] , 'c':[8,9]})
df

   a  b  c
0  3  4  8
1  8  5  9

In [77]:
#ex:2
df_dict = {'Year' : [1990, 1994, 1998, 2002],
           'Country' : ['Italy', 'USA', 'France', 'Japan'],
           'Winner' : ['Germany', 'Brazil', 'France', 'Brazil'],
           'GoalScored' : [115, 141, 171, 161]
          }
pd.DataFrame(df_dict)

   Year Country   Winner  GoalScored
0  1990   Italy  Germany         115
1  1994     USA   Brazil         141
2  1998  France   France         171
3  2002   Japan   Brazil         161

In [44]:
df = pd.DataFrame({'a':[3,8] , 'b':[4,5] , 'c':[8,9,10]})   
df          # gives value error of naot having same length array

ValueError: arrays must all be same length

In [43]:
df = pd.DataFrame({'a':['3',8] , 'b':[4,5] , 'c':[8,9]} , index = ['afsan' , 'khan'])
df

       a  b  c
afsan  3  4  8
khan   8  5  9

In [44]:
df.shape

(2, 3)

In [81]:
## 3. Creating datafrom from series

df_dict_series = {'Winner' : pd.Series(['Germany', 'Brazil', 'France'],), 
                  'GoalScored' : pd.Series([115, 141, 171, 161],),} 
df = pd.DataFrame(df_dict_series)
df

    Winner  GoalScored
0  Germany         115
1   Brazil         141
2   France         171
3      NaN         161

In [82]:
# 4 .creating dataframe from list of tuples
#mismatch will give NaN (not a Number)

df_lotuples = [(2002, 'Japan', 'Brazil', 161), 
                (2006, 'Germany', 'Italy', 147), 
                (2010, 'South Africa', 'Spain', 145),
                (2014, 'Brazil', 'Germany', 171)]

df = pd.DataFrame(df_lotuples)
df

      0             1        2    3
0  2002         Japan   Brazil  161
1  2006       Germany    Italy  147
2  2010  South Africa    Spain  145
3  2014        Brazil  Germany  171

In [85]:
df = pd.DataFrame(df_lotuples , columns=["year" , 'Country' , 'team' , "Goal scored"])
df

   year       Country     team  Goal scored
0  2002         Japan   Brazil          161
1  2006       Germany    Italy          147
2  2010  South Africa    Spain          145
3  2014        Brazil  Germany          171

In [45]:
# from list of tuples
a = [(1,2) , (2,3) , (4,5)]

df = pd.DataFrame(a)
df

   0  1
0  1  2
1  2  3
2  4  5

In [86]:
# Creating Df from list of dic

df_lodict = [
             {'year' : 2002, 'HostCountry' : 'Japan', 'Winner' : 'Brazil'},
             {'year' : 2006, 'HostCountry' : 'Germany', 'Winner' : 'Italy'},
             {'year' : 2010, 'HostCountry' : 'South Africa', 'Winner' : 'Spain'},
             {'year' : 2014, 'HostCountry' : 'Brazil', 'Winner' : 'Germany'},
            ]

df_dict_1 = {'Year' : [1990, 1994, 1998, 2002 , 2008],
           'Country' : ['Italy', 'USA', 'France', 'Japan'],
           'Winner' : ['Germany', 'Brazil', 'France', 'Brazil'],
           'GoalScored' : [115, 141, 171, 161]
          }


df = pd.DataFrame(df_lodict)
df

   year   HostCountry   Winner
0  2002         Japan   Brazil
1  2006       Germany    Italy
2  2010  South Africa    Spain
3  2014        Brazil  Germany

In [46]:
# NaN will be displayed for the not specified data
a = [(1,2) , (2,3) , (4,5,6)]

df = pd.DataFrame(a)
df

   0  1    2
0  1  2  NaN
1  2  3  NaN
2  4  5  6.0

In [14]:
#pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)


df = pd.DataFrame(data = range(1,6))
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

   0
0  1
1  2
2  3
3  4
4  5

In [15]:
df = pd.DataFrame(data = range(1,6),columns=['column1']) #passing column name aswell 
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

   column1
0        1
1        2
2        3
3        4
4        5

In [16]:
# more columns and rows (data =rows,columns= column :here imp is to matching size of passed rows and column)
df = pd.DataFrame(data = [range(1,6),range(5,10)], columns=['col1','col2','col3','col4','col5'])
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

   col1  col2  col3  col4  col5
0     1     2     3     4     5
1     5     6     7     8     9

In [45]:
df = pd.DataFrame(data = [range(1,5),range(5,10)], columns=['col1','col2','col3','col4','col5']) ##NaN=not a number will come if
df                                                                                          #you give less data in any rows
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

   col1  col2  col3  col4  col5
0     1     2     3     4   NaN
1     5     6     7     8   9.0

In [18]:
#passing nested list
df = pd.DataFrame(data = [[1,2],[3,4],[5,6],[7,8],[9,10]], columns=['col1','col2'])
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

   col1  col2
0     1     2
1     3     4
2     5     6
3     7     8
4     9    10

In [19]:
#even if single element is of higher datatype(float here ie 8.0),wholecolumn will be  interanlly typecasted to that higher datatype
df = pd.DataFrame(data = [[1,2],[3,4],[5,6],[7,8.0],[9,10]], columns=['col1','col2'])
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

   col1  col2
0     1   2.0
1     3   4.0
2     5   6.0
3     7   8.0
4     9  10.0

In [46]:
###  dataframe using dictionary
#in case of #dictionary:dictionary key will replaced to a column name

df = pd.DataFrame(data = {'a':1,'b':2,'c':4}, index = [0,1,2,3])  
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

   a  b  c
0  1  2  4
1  1  2  4
2  1  2  4
3  1  2  4

In [21]:
s = pd.Series(data = 2)
print(type(s))
s

<class 'pandas.core.series.Series'>

0    2
dtype: int64

#### Read the data from local file:
   * loading data from various sources
     - syntax :  df = pd.read_(+tab)('filename.ext')
     - pd. read + tab == gives you list of all supported files

In [22]:
#example  to read the data from locl files
### loading data from various sources
# df = pd.read_csv('practice.csv')    #pd. read + tab == gives you list of all supported files
# print(type(df))

# df.head()

In [53]:
# with csv (comm separated value) file
# csv file
df = pd.read_csv('H:\\LEARNBAY\\python\\afsaan\\dataset\\datasets/ted_data.csv')
df

,name_speaker,speaker_occupation,title,views,comments
0,Ken Robinson,Author/educator,Do schools kill creativity?,47227110,4553
1,Al Gore,Climate advocate,Averting the climate crisis,3200520,265
2,David Pogue,Technology columnist,Simplicity sells,1636292,124
3,Majora Carter,Activist for environmental justice,Greening the ghetto,1697550,200
4,Hans Rosling,Global health expert; data visionary,The best stats you've ever seen,12005869,593
5,Tony Robbins,Life coach; expert in leadership psychology,Why we do what we do,20685401,672
6,Julia Sweeney,"Actor, comedian, playwright",Letting go of God,3769987,919
7,Joshua Prince-Ramus,Architect,Behind the design of Seattle's library,967741,46
8,Dan Dennett,"Philosopher, cognitive scientist",Let's teach religion -- all religion -- in sch...,2567958,582
9,Rick Warren,"Pastor, author",A life of purpose,3095993,900

In [61]:
# excel

df = pd.read_excel('H:\\LEARNBAY\\python\\afsaan\\dataset\\datasets/football_worldcup.xlsx' )
df

   Year       Country    Winner   Runners-Up  GoalsScored  MatchesPlayed
0  1990         Italy  Germany     Argentina          115             52
1  1994           USA    Brazil        Italy          141             52
2  1998        France    France       Brazil          171             64
3  2002         Japan    Brazil      Germany          161             64
4  2006       Germany     Italy       France          147             64
5  2010  South Africa     Spain  Netherlands          145             64
6  2014        Brazil   Germany    Argentina          171             64

In [66]:
# to watch different sheets from same excel file
df_sheetname = pd.read_excel('H:\\LEARNBAY\\python\\afsaan\\dataset\\datasets/football_worldcup.xlsx' , sheet_name=['Sheet 1','demo_sheet1'])
df_sheetname   #sheet 2 is get concatinated below sheet 1 (remember you have to write as it is name with your sheet)

OrderedDict([('Sheet 1',
                 Year       Country    Winner   Runners-Up  GoalsScored  MatchesPlayed
              0  1990         Italy  Germany     Argentina          115             52
              1  1994           USA    Brazil        Italy          141             52
              2  1998        France    France       Brazil          171             64
              3  2002         Japan    Brazil      Germany          161             64
              4  2006       Germany     Italy       France          147             64
              5  2010  South Africa     Spain  Netherlands          145             64
              6  2014        Brazil   Germany    Argentina          171             64),
             ('demo_sheet1',    Year       Country
              0  1990         Italy
              1  1994           USA
              2  1998        France
              3  2002         Japan
              4  2006       Germany
              5  2010  South Africa
              6  2014        Brazil)])

In [88]:
weather_data = pd.read_csv("H:\\LEARNBAY\\python\\afsaan\\dataset\\datasets/weather_data.csv")
print(weather_data.shape)
weather_data

(6, 4)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

#### Dafualt supporting functions for Dataframe

In [90]:
# tuple unpacking
rows , column = weather_data.shape 
print(rows)
print(column)

6
4

In [99]:
weather_data.columns  # gives list column names

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [100]:
# i only want the temp
weather_data.temperature

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [101]:
#for 2 columns
weather_data[['temperature' , 'event']]

   temperature  event
0           32   Rain
1           35  Sunny
2           28   Snow
3           24   Snow
4           32   Rain
5           31  Sunny

In [95]:
# 1. head function >> gives you top result(default = top 5) with specified no in bracket
weather_data.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [96]:
weather_data.head(1)

        day  temperature  windspeed event
0  1/1/2017           32          6  Rain

In [97]:
# tail  >> gives you bottom result(default = bottom 5) with specified no in bracket
weather_data.tail()

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

### Accessing rows, columns, cells

In [23]:
#sample dataframe
import pandas as pd
df = pd.DataFrame(data = [[1,2,32],[3,4,45],[5,6,34],[7,8.0],[9,10,12]], columns=['col1','col2','col3'])
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

   col1  col2  col3
0     1   2.0  32.0
1     3   4.0  45.0
2     5   6.0  34.0
3     7   8.0   NaN
4     9  10.0  12.0

#### using loc[ ]  : loc == location
    -# df.loc[]: [<rows range>,<columns range>] >> [<start:end>,<start:end>] OR [<[i1,i2,i3,..iN]>,<c1,c2,c3,...cN>]

In [24]:
#using [<start:end>,<start:end>]

df.loc[1:2,'col2':'col3']   #in loc next part of ':' is always exclusive

   col2  col3
1   4.0  45.0
2   6.0  34.0

In [25]:
#using [<[i1,i2,i3,..iN]>,<c1,c2,c3,...cN>]

df.loc[[1,2],['col2','col3']]  # mind that if double square bracket comes ('[[ ]]') means its a dataframe form
                               # if its a single square bracket ('[ ]') its always a series form

   col2  col3
1   4.0  45.0
2   6.0  34.0

In [26]:
#assigning index manually
df = pd.DataFrame(data = [[1,2,32],[3,4,45],[5,6,34],[7,8.0],[9,10,12]], columns=['col1','col2','col3'],
                 index = ['a','b','c','d','e'])
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

   col1  col2  col3
a     1   2.0  32.0
b     3   4.0  45.0
c     5   6.0  34.0
d     7   8.0   NaN
e     9  10.0  12.0

In [27]:
#accessing
df.loc['b':'c','col2':'col3']

   col2  col3
b   4.0  45.0
c   6.0  34.0

#### iloc[ ]:  iloc == index of location
    -# df.iloc[] : [<rows range>,<columns range>] >> [<start:end>,<start:end>] OR [<[i1,i2,i3,..iN]>,<c1,c2,c3,...cN>]

In [28]:
#sample dataframe
df = pd.DataFrame(data = [[1,2,32],[3,4,45],[5,6,34],[7,8.0],[9,10,12]], columns=['col1','col2','col3'],
                 index = ['a','b','c','d','e'])
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

   col1  col2  col3
a     1   2.0  32.0
b     3   4.0  45.0
c     5   6.0  34.0
d     7   8.0   NaN
e     9  10.0  12.0

In [29]:
#in iloc acessing done by using indexing

df.iloc[1:3, 1:3] #in iloc next part of ':' is always exclusive

   col2  col3
b   4.0  45.0
c   6.0  34.0

In [30]:
df.iloc[[1,2], [1,2]]

   col2  col3
b   4.0  45.0
c   6.0  34.0

#### using [ ] operator => slicing on columns

In [31]:
df = pd.DataFrame(data = [[1,2,32],[3,4,45],[5,6,34],[7,8.0],[9,10,12]], columns=['col1','col2','col3'],
                 index = ['a','b','c','d','e'])
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

   col1  col2  col3
a     1   2.0  32.0
b     3   4.0  45.0
c     5   6.0  34.0
d     7   8.0   NaN
e     9  10.0  12.0

In [32]:
# selecting single column as series
df2 = df['col2']
print(type(df2))
df2

<class 'pandas.core.series.Series'>

a     2.0
b     4.0
c     6.0
d     8.0
e    10.0
Name: col2, dtype: float64

In [33]:
# selecting single column as dataframe
df2 = df[['col2']]
print(type(df2))
df2

<class 'pandas.core.frame.DataFrame'>

   col2
a   2.0
b   4.0
c   6.0
d   8.0
e  10.0

In [34]:
# selecting multiple columns
# ex with 2 column
df2 = df[['col2','col3']]
print(type(df2))
df2

<class 'pandas.core.frame.DataFrame'>

   col2  col3
a   2.0  32.0
b   4.0  45.0
c   6.0  34.0
d   8.0   NaN
e  10.0  12.0

In [35]:
# selecting multiple columns 
# ex with 3 column
df2 = df[['col2','col3','col1']]
print(type(df2))
df2

<class 'pandas.core.frame.DataFrame'>

   col2  col3  col1
a   2.0  32.0     1
b   4.0  45.0     3
c   6.0  34.0     5
d   8.0   NaN     7
e  10.0  12.0     9

### Adding new columns to existing dataframe

In [36]:
# sample dataframe
df = pd.DataFrame(data = [[1,2,32],[3,4,45],[5,6,34],[7,8.0],[9,10,12]], columns=['col1','col2','col3'])
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

   col1  col2  col3
0     1   2.0  32.0
1     3   4.0  45.0
2     5   6.0  34.0
3     7   8.0   NaN
4     9  10.0  12.0

In [37]:
df['col4'] = df['col2'] - df['col1']
df

   col1  col2  col3  col4
0     1   2.0  32.0   1.0
1     3   4.0  45.0   1.0
2     5   6.0  34.0   1.0
3     7   8.0   NaN   1.0
4     9  10.0  12.0   1.0

In [38]:
df['col5'] = 2
df

   col1  col2  col3  col4  col5
0     1   2.0  32.0   1.0     2
1     3   4.0  45.0   1.0     2
2     5   6.0  34.0   1.0     2
3     7   8.0   NaN   1.0     2
4     9  10.0  12.0   1.0     2

### filtering out operations on dataframe:

In [39]:
#sample dataset to perform operations
import pandas as pd
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings', 'Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'], 
            'Rank': [1, 2, 2, 3, 3, 4 ,1 , 1, 2 , 4, 1, 2], 
            'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017], 
            'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [40]:
df.head() #.head gives you top 5 results from dataframe

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
2  Devils     2  2014     863
3  Devils     3  2015     673
4   Kings     3  2014     741

In [41]:
### filter out data of the year 2015
df[df.Year== 2015]

      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    Kings     4  2015     812
10  Royals     1  2015     804

In [42]:
### select 'Points' for every team for the year 2015
df[df.Year==2015]['Points']

1     789
3     673
5     812
10    804
Name: Points, dtype: int64

In [43]:
# ### filter out data of the year 2015 and Rank greater than 1
df1= (df.Year == 2015 ) &  (df.Rank > 1) # need to creat in tuple bracket and then pass in list bracket
print(df[df1])

print('\n OR\n')

df[df.Year == 2015][df.Rank > 1]

     Team  Rank  Year  Points
1  Riders     2  2015     789
3  Devils     3  2015     673
5   Kings     4  2015     812

 OR

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  import sys

     Team  Rank  Year  Points
1  Riders     2  2015     789
3  Devils     3  2015     673
5   Kings     4  2015     812

In [44]:
## for each 'Team' calculate average of 'Points'
print(df[df['Team'] == 'Riders']['Points'].mean())
print(df[df['Team'] == 'Kings']['Points'].mean())
print(df[df['Team'] == 'Devils']['Points'].mean())
print(df[df['Team'] == 'Royals']['Points'].mean())

print('\n')

# alternative method to calculate average of series
import numpy as np
print(np.mean(df[df['Team'] == 'Riders']['Points']))

762.25
774.25
768.0
752.5


762.25

In [45]:
# through loop
for team in df.Team.unique(): # unique() returns unique values in the series
    print(df[df['Team'] == team]['Points'].mean())

762.25
768.0
774.25
752.5

## Drop/Remove column(s)

In [46]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [47]:
#df.drop == to remove
df.drop(5,axis =0,inplace=True)  #axis = '0':if indices/row wise deletion use
df                              #axis = '1':if column wise deletion use

# in this case 6th row(5 in indices) is got removed

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [48]:
#sample data

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings', 'Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'], 
            'Rank': [1, 2, 2, 3, 3, 4 ,1 , 1, 2 , 4, 1, 2], 
            'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017], 
            'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [49]:
#remove columnwise
# remove column 'Rank'
# df = df.drop('Rank', axis = 1) # axis = (0/1) where 0: indices and 1: columns
df1=df.drop('Rank', axis = 1, inplace = True)
df1

In [50]:
df.drop(['Year','Points'], axis = 1, inplace = True)
df

      Team
0   Riders
1   Riders
2   Devils
3   Devils
4    Kings
5    Kings
6    Kings
7    Kings
8   Riders
9   Royals
10  Royals
11  Riders

### OPERATIONS: head(), tail(), unique(), shape, size, rename(), info(), describe(), sort_values()

In [51]:
#head() : gives you first 'n' (defualt 5) results from dataframe

ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings', 'Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'], 
            'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2], 
            'Year': [2014,2015,2014,2015,2014,2015,2016,2017,
2016,2014,2015,2017], 
            'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
print(df.head())
print ('\n')
print(df.head(3))
df.head()

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
2  Devils     2  2014     863
3  Devils     3  2015     673
4   Kings     3  2014     741


     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
2  Devils     2  2014     863

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
2  Devils     2  2014     863
3  Devils     3  2015     673
4   Kings     3  2014     741

In [52]:
df.head()  # head() : gives you first 'n' (defualt 5) results from dataframe

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
2  Devils     2  2014     863
3  Devils     3  2015     673
4   Kings     3  2014     741

In [53]:
df.tail()   # tail() :gives you last 'n' (defualt 5) results from dataframe

      Team  Rank  Year  Points
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [54]:
df.Rank.unique() # unique(): gives unique values and avoid duplications from dataframe/series

                 #See Also
                    # unique : Top-level unique method for any 1-d array-like object.
                   # Index.unique : Return Index with unique values from an Index object

array([1, 2, 3, 4], dtype=int64)

In [55]:
df.shape # returns (rows, columns) in tuple form

(12, 4)

In [56]:
df.size       #Return the total number of elements in this object.
              # Return the total number of rows only if Series.

48

In [57]:
df.rename(columns = {'Points':'Scores'}, inplace = True) #to rename
df.head(2)

     Team  Rank  Year  Scores
0  Riders     1  2014     876
1  Riders     2  2015     789

In [58]:
df.info()  #This method prints information about a DataFrame including
           #the index dtype and column dtypes, non-null values and memory usage.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
Team      12 non-null object
Rank      12 non-null int64
Year      12 non-null int64
Scores    12 non-null int64
dtypes: int64(3), object(1)
memory usage: 512.0+ bytes

In [59]:
df.describe() #gives all statistical info like mean ,count etc on numerical columns only

            Rank         Year      Scores
count  12.000000    12.000000   12.000000
mean    2.166667  2015.166667  765.583333
std     1.114641     1.114641   67.849376
min     1.000000  2014.000000  673.000000
25%     1.000000  2014.000000  699.250000
50%     2.000000  2015.000000  772.000000
75%     3.000000  2016.000000  806.000000
max     4.000000  2017.000000  876.000000

In [60]:
df.sort_values(by = ['Year','Scores'], ascending = [False, False],inplace=False )


#here on two column ie year and score if asceding = true >>   asceding order
#                                    if asceding = false >>   desceding order
#inplace = true >> overwrite new data on old
#          false >> shows result for this cell only and not overwrite

      Team  Rank  Year  Scores
7    Kings     1  2017     788
11  Riders     2  2017     690
6    Kings     1  2016     756
8   Riders     2  2016     694
5    Kings     4  2015     812
10  Royals     1  2015     804
1   Riders     2  2015     789
3   Devils     3  2015     673
0   Riders     1  2014     876
2   Devils     2  2014     863
4    Kings     3  2014     741
9   Royals     4  2014     701

#### function application
 - apply() : row-wise/ column-wise
 - applymap()  : cell-wise

In [61]:
df2

   col2  col3  col1
a   2.0  32.0     1
b   4.0  45.0     3
c   6.0  34.0     5
d   8.0   NaN     7
e  10.0  12.0     9

In [62]:
## apply() with inbuilt functions
df2.apply(func = 'mean', axis = 0) # axis = 0 with mean gives you column wise average 
                                    # axis = 1 with mean gives you row wise average

col2     6.00
col3    30.75
col1     5.00
dtype: float64

In [63]:
 # axis = 1 with mean gives you row wise average 
df2.apply(func = 'mean', axis = 1) # apply with inbuilt function

a    11.666667
b    17.333333
c    15.000000
d     7.500000
e    10.333333
dtype: float64

In [64]:
#using numpy
np.mean([1,2014,876])

963.6666666666666

In [65]:
# apply with named function /user defined function

def mean_(col):
    return np.mean(col)

df2.apply(func = mean_, axis = 0) # apply with named function

col2     6.00
col3    30.75
col1     5.00
dtype: float64

In [66]:
## apply()
df2.apply(func = lambda x: np.mean(x), axis = 0) # apply with lambda function

col2     6.00
col3    30.75
col1     5.00
dtype: float64

In [67]:
## df.drop('Team', axis = 1).apply(func = mean_, axis = 0)

#### applymap() :directly apply operations with all rows and columns (mapping /broadcasting )
    -multiply each value in the dataframe df2 with 2

In [68]:
df2.applymap(func = lambda x: x*2) #direct mul not possible so lambda fun used

# mul by 2 to all column and rows

   col2  col3  col1
a   4.0  64.0     2
b   8.0  90.0     6
c  12.0  68.0    10
d  16.0   NaN    14
e  20.0  24.0    18

In [69]:
df2.applymap(func = lambda x: x*2) .head() #using head ()

   col2  col3  col1
a   4.0  64.0     2
b   8.0  90.0     6
c  12.0  68.0    10
d  16.0   NaN    14
e  20.0  24.0    18

In [70]:
df.applymap(func = lambda x: x*2).head() # '*' operator replicates a string

           Team  Rank  Year  Scores
0  RidersRiders     2  4028    1752
1  RidersRiders     4  4030    1578
2  DevilsDevils     4  4028    1726
3  DevilsDevils     6  4030    1346
4    KingsKings     6  4028    1482

In [71]:
# Try out: create a new column [mapped_Team] having mapped values for column Team as below:
######## Riders=> 0, Kings => 1, Devils => 2 and Royals => 3

In [72]:
df['mapped_Team'] = df.Team.map({'Riders':0,'Kings':1,'Devils':2,'Royals':3})
df.head()

     Team  Rank  Year  Scores  mapped_Team
0  Riders     1  2014     876            0
1  Riders     2  2015     789            0
2  Devils     2  2014     863            2
3  Devils     3  2015     673            2
4   Kings     3  2014     741            1

##  group by operation on dataframe
#### Once data is split on a group_id, any of the following operations can be performed
 - aggregation
 - transformation
 - filtering

In [73]:
import pandas as pd
import numpy as np

In [74]:
#example
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 
                     'Kings', 'Kings', 'Kings', 'Kings', 
                     'Riders', 'Royals', 'Royals', 'Riders'], 
            'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2], 
            'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017], 
            'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [75]:
df.groupby(['Team']).groups
#here .groupby splits mentioned keyword into group
#.groups is useful to see splitted new groups
df.groupby()

TypeError: You have to supply one of 'by' and 'level'

#### aggregation: max, min, count, unique, average

In [76]:
## for each 'Team', find 'Points' average  as a list
df.groupby('Team')['Points'].mean()

Team
Devils    768.00
Kings     774.25
Riders    762.25
Royals    752.50
Name: Points, dtype: float64

In [77]:
## for each 'Team', find 'Points' average  as a dataframe
df.groupby('Team')[['Points']].mean()

        Points
Team
Devils  768.00
Kings   774.25
Riders  762.25
Royals  752.50

In [78]:
## for each 'Team', find 'Rank' maximum value 
df.groupby('Team')[['Rank']].max()

        Rank
Team
Devils     3
Kings      4
Riders     2
Royals     4

In [79]:
## for each 'Team', find the average on 'Points' and 'Rank'
df.groupby('Team')[['Points','Rank']].mean()

        Points  Rank
Team
Devils  768.00  2.50
Kings   774.25  2.25
Riders  762.25  1.75
Royals  752.50  2.50

In [81]:
## for each 'Team', find the average on 'Points' and maximum value on the'Rank'
#Method 1
df2 = df.groupby('Team')[['Points','Rank']].agg({'Points':'mean', 'Rank':'max'}).rename(columns = {'Points':'Points_Average','Rank':'Rank_Maximum'})
df2

#.agg use to multiple function
#.rename used to change column names

        Points_Average  Rank_Maximum
Team
Devils          768.00             3
Kings           774.25             4
Riders          762.25             2
Royals          752.50             4

In [82]:
## for each 'Team', find the average on 'Points' and maximum value on the'Rank'
df.groupby('Team')[['Points','Rank']].agg({'Points':'mean', 'Rank':'max'}).sort_values('Points', ascending = True)

        Points  Rank
Team
Royals  752.50     4
Riders  762.25     2
Devils  768.00     3
Kings   774.25     4